<pad>
<unk>
<eos>
<sos>
<mask>
8
,
.
11
26
51
15
79
鈥
44
-
6
20
96
"
60
110
14
257
128
102
154
493
105
453
46
172
23
94
483
139
:
315
159
62
322
181
)
264
(
182
427
148
28
121
314
464
277
53
245
259
133
527
103
78
241
'
472
104
387
41
780
907
3253
162
22
71
69
136
32
439
152
671
319
149
585
307
119
143
1099
255
517
339
362
388
25
342
480
775
434
374
513
673
1039
247
?
2509
863
363
294
344
1227
353
$
2324
39
114
;
17
287
510
1156
244
250
296
438
740
117
412
/
5199
33
753
64
562
3011
619
719
956
129
164
1298
445
177
537
466
528
633
614
127
1301
985
1327
3717
111
52
366
904
3257
2442
488
1549
113
1167
460
61
2070
233
828
910
249
485
1293
3008
574
1355
100
1526
%
1294
1297
380
1645
491
317
30
397
31
194
1111
1396
4344
1318
2520
75
1375
1938
425
36
449
81
854
1385
1571
2624
2221
1420
275
1352
1074
790
2173
351
1853
216
1577
1304
2012
865
1827
316
1057
2552
1990
506
1469
2746
364
2166
348
1430
58
577
545
拢
[
1018
1388
281
200
1415
195
978
379
2081
213
656
911
]
1930
2332
1466
--
508
2220
&
1584
1643
1295
1369
1765
347
174
1071
5685
134
3716
5156
824
!
2532
428
3974
681
1038
1398
1351
582
1222
706
1460
1011
829
35
1191
1823
4962
1986
1527
1346
5346
690
3424
2564
2518
862
448
2664
4403
2843
2231
410
2700
3145
424
27
157
221
155
3648
1819
263
2734
1256
3712
1310
393
326
1116
2250
2880
3347
589
627
698
1314
1198
1088
3509
2370
974
2055
291
1757
1240
551
2078
392
1050
860
1429
2260
5821
1124
1312
1365
1157
2954
2583
1253
3700
201
613
191
881
2992
1516
987
125
1459
293
185
857
3159
1328
576
2774
1291
1068
2060
3779
2229
620
1096
2681
1127
925
914
649
2943
723
179
2704
5004
4000
286
2303
4088
3208
2920
1000
900
419
1912
2341
432
3798
4306
520
1626
72
559
1062
802
470
2295
1263
3909
3679
1661
1333
2584
1844
1902
835
1777
2689
529
864
3086
1218
4705
83
4501
297
...
616
6992
1269
4428
1109
2549
248
1714
2825
1239
336
479
5848
5169
305
1184
3901
1251
651
45
1691
12
853
2315
2390
748
3241
738
816
2838
819
1134
1173
1993
1302
368
1248
705
1917
2570
1390
1477
2385
597
3051
1455
3204
2320
3613
1175
1552
150
2810
1392
1462
1946
1522
1840
761
1055
776
3987
625
151
420
99
1080
1928
215
4151
2180
3352
2147
2768
557
866
214
2507
2041
40
2170
686
4389
345
1341
1662
4030
1154
3603
1568
5250
359
1051
4610
1006
1901
512
34
936
896
769
737
1943
7157
4195
940
5283
1193
771
394
3036
2453
327
3671
2313
1325
468
10475
8034
3657
3035
697
962
2522
11115
758
1488
2670
658
13941
2342
299
3370
2856
7776
1774
643
502
116
1694
132
2793
700
565
63
1565
5275
3470
3053
8197
3720
444
2004
23122
90
1530
3774
169
2014
507
647
2223
2569
2269
1605
1911
1338
1670
806
1644
3030
8622
3062
827
1766
556
1638
228
2063
10177
1067
1267
2095
184
536
2022
3190
4569
1084
1281
1606
4855
5860
1418
1805
1413
2098
93
334
1838
2510
3693
639
8515
1602
2796
19
629
4624
1720
178
11770
2273
1380
1225
2348
704
3510
4141
3714
2099
298
1023
2016
3394
1557
5940
3692
6654
3050
1842
642
1906
2146
1996
1523
1933
546
1548
1412
1150
3885
6238
8365
1748
1384
8823
1601
2500
799
4347
3025
3362
4096
1761
3277
7599
1687
6326
4438
3426
3096
912
9498
1955
5716
4641
5871
2991
4903
1926
919
530
535
2019
3326
2593
834
13794
855
10142
4679
10322
1686
9368
6723
3503
563
5206
3028
8629
289
1510
1598
6234
2133
8441
330
6795
475
1339
1257
3575
5908
1290
2632
594
5857
4876
2225
840
1299
4260
3830
4634
227
3032
3361
945
168
1401
4944
4132
471
3601
509
653
2645
1449
1389
2156
2367
4947
1461
385
2893
384
2626
1476
360
3014
2277
1977
3593
5964
1939
716
1528
3812
431
1778
2897
2134
5707
349
4650
3590
2030
3058
1535
122
2956
3527
1854
1910
5898
1382
1711
2381
145
4218
21
3085
997
137
3205
5751
1706
4170
831
1053
736
4580
754
11179
2476
6468
1439
4579
1475
3903
6331
256
5779
4952
1582
2265
2581
7209
1735
2588
623
2154
588
1321
1085
188
1278
4268
2639
2366
1808
3232
3819
209
2755
1246
4114
1866
1997
5881
14941
284
5421
4315
5267
8525
2148
1306
6437
5048
1811
2327
400
1155
11278
2812
3652
1883
592
685
*
2452
5136
9839
211
1282
2641
4401
941
1479
1066
1122
720
6769
1192
6017
2267
2951
1358
1093
3709
4582
2759
2597
4678
3900
2912
794
2177
3983
938
4420
2008
1262
4326
220
2771
7445
3461
6977
4397
3471
6587
3163
4857
4207
622
3956
8667
158
4863
1387
3343
3880
4688
1847
2052
1908
3533
4645
732
4436
1907
12590
580
670
1174
1118
1836
2162
2748
2139
969
1746
5272
341
3111
4281
2559
9760
7935
1363
5200
1189
5619
1480
346
6245
1279
5945
4881
4628
1123
1852
755
1890
684
1508
1172
710
1021
192
3504
2420
2198
1129
3685
5985
2204
5849
1264
14380
5000
489
10071
920
1721
980
2485
2604
3875
1502
6963
16
7495
1139
61888
9454
5058
2603
112
2896
1009
1307
540
7417
3114
3600
5577
''
367
1613
3478
1944
858
5080
2182
1512
2634
617
3240
4986
3123
2737
4908
533
3
822
5712
461
873
5312
1989
650
1436
441
1047
3380
2820
4924
5679
210
6155
372
2484
646
2400
1698
2872
2387
2358
2547
1437
3425
5381
6619
2407
976
676
1270
4325
4922
3318
1699
2941
1794
2137
2985
4813
3687
4502
3339
4833
273
4836
2517
7418
57
1763
333
2672
26552
6819
6461
1509
9597
13200
6497
927
1704
4555
3487
4339
3216
555
2317
1952
8141
696
262
522
4041
4234
15668
1690
5747
3345
2909
883
23039
1716
3865
2463
3251
3666
1885
1731
4016
549
5694
4188
11604
2680
5608
821
6318
2608
465
1630
3732
526
1142
21282
1141
5173
2718
1795
5223
141
6959
3325
5418
2143
6363
2903
1188
5245
2887
990
1631
504
12593
4414
2266
2029
9442
4250
4447
4452
2679
2892
1513
6832
1292
4489
1877
鈥濃
371
2684
2905
844
2093
5554
2355
6415
6218
17499
7035
243
4424
695
675
4740
1422
2613
944
1202
5320
3336
2876
618
1964
1343
3667
1065
4546
5197
3831
1500
5859
890
4309
1431
17428
4935
5717
2425
10195
3911
5067
2773
5916
5310
906
1040
6336
3994
1453
3249
3210
6689
3982
423
1125
1718
947
3836
3206
118
3670
1546
3968
4830
5709
421
9641
6584
2192
2278
18547
6068
578
2487
7567
2113
12230
5735
1688
8119
3791
9049
3446
212
4694
6969
2656
13438
1069
1315
2335
10505
17148
4107
1195
3838
14610
2611
1678
3497
701
1770
6931
1689
4367
3000
130
3402
4398
2431
1190
5097
2548
2702
1752
4872
2868
5264
2494
3130
4111
538
278
7545
436
3406
2671
5660
288
3419
260
8927
4584
3787
2841
3142
2592
7026
7198
564
1169
8974
3312
2360
2199
13385
8602
5657
7076
4671
1414
1022
238
280
1727
731
5590
26023
2572
2568
13825
733
575
8012
1289
5274
3683
4598
950
11111
6869
166
5420
3950
7284
3115
3184
5993
4228
739
638
5570
4838
2403
3320
964
7510
3408
6894
6135
2002
6079
4692
4178
1235
3245
9507
3519
4106
782
1887
1275
2291
33786
5522
2256
3201
5752
6308
2528
8854
4167
144
541
5259
1201
2035
408
6006
23802
1266
752
2988
4888
2859
4198
14484
2432
3494
981
1660
5503
5030
10676
24240
12546
6393
1309
712
202
14672
6629
3802
5311
7054
10972
3610
76
2562
1702
11389
2993
3334
2836
9809
4716
416
3585
4200
2455
6105
2100
7738
1131
3316
3582
437
5191
6283
2242
2665
2000
226
1726
4050
4713
8526
11411
1762
318
913
312
1171
4386
7714
7469
5698
14486
10315
4543
1271
9180
1966
4253
6118
4144
2482
2814
3857
1354
2124
4803
1115
12682
3782
6660
8299
5490
1357
7072
5480
2925
2308
5875
1806
3781
872
11917
1347
409
3883
3845
3996
2406
11122
4335
1740
5542
3022
8842
1663
2885
3244
751
8596
2720
6072
1835
8661
4825
2875
193
6918
4455
3833
4274
3153
1450
3528
1634
6499
1833
2349
2080
6141
2685
1063
2294
1434
4653
12220
5236
2262
5442
18953
2573
4467
6858
8287
2110
4594
4824
15819
5669
951
8928
12818
846
3388
4847
13217
3342
560
6593
5277
3063
3826
1507
6524
5966
6077
4778
413
13192
2498
6227
9624
1671
1958
2849
4086
3556
5432
14395
838
14475
2362
1133
750
5238
2261
8719
1025
7088
3211
3285
870
77
6494
4774
7604
1729
3793
5947
7080
2123
2715
4604
3135
8291
10107
4190
3250
7775
1814
2808
11051
33798
14250
308
711
6592
11244
9999
6235
2795
3198
4349
5773
5718
13637
5732
2968
1918
3511
4374
4012
977
8380
52718
2946
|
1858
9006
1697
542
2259
5010
2422
4909
18257
5132
6120
5013
10522
2904
16092
4211
4444
9345
6088
1927
300
2750
3462
605
4391
5953
2010
5504
891
6876
390
3482
5298
2979
3299
1541
4382
7763
6895
2159
1764
2339
3730
4365
9758
4392
1247
2678
7212
208
16468
7475
6529
4799
5697
608
1241
3734
1042
3813
648
4465
3356
1228
9513
3808
92
3397
3278
7332
7952
6860
3790
5699
3605
6249
1666
1049
4322
2353
10448
5851
381
15670
3643
9642
10615
764
1632
1408
525
4879
7178
573
7713
5157
4047
19714
3588
3200
957
3364
6018
5882
1962
874
8065
4791
11618
5475
7746
5452
7586
3451
4263
6943
4916
6157
1372
4307
4719
2073
4728
5612
2252
5984
4126
722
4217
2961
2612
7183
5663
1395
5819
7772
20685
3945
6323
4179
1276
3067
5541
19507
17756
鈧
3701
2275
859
3634
5413
101
4441
10504
8953
3155
84
9703
4292
3553
1402
4443
5748
2871
4788
2184
9950
1448
3934
2674
10146
4796
3707
9586
2092
6715
8144
3698
9916
5528
1751
3319
3970
3423
3026
8906
1627
5765
1625
1675
7374
609
9523
9889
3474
3194
2412
4681
56060
5405
4460
2331
5883
4853
1076
992
10556
5124
8170
3118
4966
2383
15584
8850
6875
13088
8414
2033
1818
801
2458
971
7779
2553
2693
9268
1953
8342
4984
10639
4380
612
11484
2489
13640229
3539
9446
4972
3467
680
511
12409
5575
4994
2478
8880
183
1215
1331
7290
1272
3484
4303
9432
2175
10181
1936
2735
66
5345
12587
4394
11386
369
3651
2168
5499
9501
3378
2150
2873
9251
5128
8378
11118
9546
22359
1147
5571
3902
5567
20025
5628
9
389
7829
1043
2580
5449
4230
518
5647
2214
640
4907
6640
4378
5872
37
2526
2987
3315
1742
3920
4519
5362
4370
6113
331
2790
5194
5633
5742
12708
1399
4689
20100
11579
4521
2325
3518
6732
8970
10852
3549
3381
3335
7127
2866
5237
2153
5937
6536
2882
6083
10228
1261
13
4493
4108
10949
8982
2006
7483
4032
1268
14329
13442
1260
5816
3570
10185
4279
999
18544
5470
9627
4929
3296
10535
1792
10331
3744
6288
10192
11232
23487
4556
1881
2829
10922
5379
601
3695
3255
1656
1734
11526
6559
5244
1611
9310
3955
7141
4092
95
9588
746
7220
4766
6866
5594
9966
3821
276
5233
5828
3574
8471
4848
13210
1255
5273
6220
4110
43910
5354
4074
4147
7049
5340
1715
10487
11981
10731
6110
38461
11716
9629
6815
1915
2683
1061
3221
9980
2144
4588
180
6244
2380
10290
747
2667
2097
5098
1945
4369
6549
953
7589
5854
10378
9715
11194
206
4159
10529
1164
12113
3743
4553
3795
1468
15052
8540
2962
9124
10459
3611
5763
1254
6180
3101
5214
6512
4350
1394
8999
2851
26534
14935
8036
10289
2830
3606
4529
3637
1515
5498
6028
2068
3516
14492
5281
574145
9819
5609
1151
1204
877
鈥欌
9534
960
21098
1604
5991
7740
13326
5279
6297
5580
11134
1862
825
4221
11176
8092
12504
5126
14663
2521
7933
8472
6200
10729
2171
2978
5181099
4423
6917
3856
2364
6983
3017
5464
3828
1867
4171
5435
2483
5186
12618
3146
8941
10335
2129
2861
4934
543
15482
3290
1001
4522
20334
23264
7895
4083
3672
9483
2047
12124
11499
1540
1308
1551
10365
6588
27671
6205
9369
9944
19230
3537
1373
18988
6811
10785
14211
6873
7274
1019
2369
10256
5680
6907
22529
2240
4536
2840
10806
2618
3144
5598
5287
8274
10463
10833
24652
6408
8757
8975
9185
5269
12065
6940
1524
5153
3270
5915
5043
4591
1839
5786
6571
6804
5247
8917
5850
1287
2450
1873
11367
9260
26421
13067355
3411
4013
5736
10745
7904
9818
8559
1807
702
8879
1367
2409
4449
18469
4722
6789
2045
3624
406
11204
3109
6049
3939
309
1216
2630
4043
905
3046
6226
14703
5059
10316
2090
2411
12187
1616
6792
9367
4901
6450
5453
6548
871
5323
5407
5827
10667
10229
5582
25972
9983
1991
4231
2466
2536
7513
27612
2140
11031
6084
1197
6158
1863
285
4806
654
4762
5653
9469
10495
43306
6111
337
15792
818
3340
6184
24852
378
11442
1505
6803
12696
4473
1961
3597
845
929
2642
5909
12192
19412
524
3090
12837
2135
1470
6742
8130
19856
1925
10386
1017
8495
321
2394
5204
6967
2744
2561
10614
2942
16155
1618
11858
7905
4266
6891
3772
3498
+
6523
4163
3751
7569
1114
1897
1491
7335
5684
3327
9112
3274
3726
5516
17825
13712
1386
5661
6830
13640260
15660
8790
942
9461
2178
6134
635
768
10531
674
2053
1490
4007
3460
2729
3264
7967
2174
8875
9974
14521
440
3358
13463
2698
10072
4850
777
10114
492
2351
4025
2541
2935
3154
4702
3980
8634
1177
6229
6406
7966
7857
1353
2834
5246
4067
2457
3095
2975
1753
8675
1588
5521
2236
1984
451
8918
131
13110279
3192
677
3957
2939
7276
5087
2763
523
5766
5224
514
5419
26162
3031
4324
6063
24248
2337
2069
7591
1334
6519
1137
18464
6763
6108
2745
4017
2329
5027
3439
2414
1876
3400
8531
>
8060
1639
35028
12713
8248
4199
4090
3621
17340
4844
3098
2142
5282
5443
972
7983
5973
8910
16004
5673
13873
1152
170
12780
2845
3049
62238
43
10305
12501
4842
5794
13066656
7021
4770
6208
3427
10199
4608
2046
8147
9024
3998
1817
5562
175
2205
7114
1102
9037
8323
9865
1452
279
2524
1668
8732
5539
9678
10187
4183
4565
13659
6412
6897
13822
2944
2172
1556
375
8489
15816
3756
12592
14616
7948
7653
788
3761
3468
3197
4739
5774
4138
7494
3151
2818
8165
4042
47
2062
3799
1077
8552
5496
33117
18133
2582
2907
13640261
19005
3877
443
13713
1146
8387
8753
5550
10654
2806
571
6700
2064
15779
3436
3512
2444
473
11273
5878
4432
7867
7353
8631
7243
8528
10088
2708
20694
2419
2780
19440
5462
3891
1695
812
5866
3298
6492
3975
2760
18247
4544
662
3925
4866
9500
9939
5759
2816
5423
5109
11060
27682
1707
933
16821
3088
4913
9668
8492
5513
5278
5862
6139
267
2833
1008
3688
18200
13550
4677
19397
1207
4284
5894
3665
2480570
7755
5260
5601
24987
3641
24386
3986
15480
4068
27319
9110
3110
2215
14115
14482
2469
4636
4612
749
7406
3500
8662
10461
13994
5149
3164
1667
4957
3433
13126
6495
12331
3689
10342
3538
11407
13710
6694
6217
2286
6198
8572
18694
3121
1349
14602
6020
4259
12158
54
18591
1730
2
17696
1779
4846
8828
4953
12373
5494
3242
8089
3941
11101
9067
12385
20860
3140
6750
13788
703
8519
5530
3678
9660
2372
1562
4129
8156
10025
5662
6553
1445
8245
9088
2101
1379
9519
3434
10571
553
1196
4854
14591
5026
10795
4121
115
2018
5113
5152
9111
51478
4804
6328
4738
5375
9671
2330
4248
1572
5065
5403
16355
24113
7765
5459
5520
5588
13663
13779
1913
3649
954
5235
2621
13258
18728
5788
4964
3226
3860
7329
62915
2977
1696
7096
11316
2881
6957
12469
4859
7264
3531
1487
2930
615
7960
3348
203
15520
16680
35788
13355
6465
11568
6987
6951
2285
2505
3969
1832
109946
8616
10329
3848
786
8566
20854
7864
3366
2831
4158
1705
11092
4558
12732
54026
19292
9294
718
7431
6421
10367
4278
4760
6864
4700
=
16078
7727
10944
18462
454
2297
9287
123
7646
9665
5211
5527
6014
5824
1319
1340
4286
9012
17192
4409
12849
2610
59
6046
2712
5112
6925
11923
12094
18480
22289
3103
13450
13831
4140
15760
3770
13702
4360
9864
2271
3477
10093
2257
240
4520
12996
9053
8902
4100
6038
1329
17137
9840
10563
1403
7708
15966
5465
11625
7089
4971
7111
3705
2921
14480
10604
8770
15472
1772
187
3267
1426
1592
641
6428
6098
22545
12831
2579
16947
2102
2227
13635
5624
36745
11175
8751
13334
1393
11477
2917
1978
8167
10380
730
13769
6979
18190
10511
13321
3771
18814
9651
5045
5900
4117
12134
17799
13150
1232
6129
10480
3041
2499
1872
1803
4267
9757
19189
3443
13802
2558
7165
12473
7576
82
939
8954
13221
4680
6982
660
8336
6377
2952
14132
11491
569
1619
4258
13981
7486
6034
7480
10983
6968
11451
2591
3620
4767
21450
13523
13804
140
14999
1816
24014
5288
4485
4829
18975
9436
12307
292
2161
17701
1825
3547
12778
1406
426
2948
1596
17871
2279
7142
8145
3971
10970
7117
4780
6443
6661
4165
5620
6334
3522
688
22506
13552
5239
110847
3640
876
961
3529
13051
14076
340
132433
10047
7689
9756
1377
17475
8747
5931
4264
14324
4517
17490
4936
6595
3195
6332
11879
9097
5248
11428
2037
1136
11470
4
6282
10935
12609
14110
1801
9416
9022
10913
11119
18494
12860
6954
7986
6770
4958
18008
699
301
8947
8829
14189
38497
13225
7454
2926
4015
2765
6486
24486
9084
8313
239
414
4439
18962
10810
2026
3089
18775
6144
2901
742
9291
13826
9928
2479
11052
10671
40470
4078
8416
17610
683
1594
4975
3507
10644
9956
2136
2304
14400
352
6838
7124
6102
13625
4988
12193
2386
3592
3966
482
6231
9517
5022
9822
8155
1203
63381
7641
232
9381
2106
5853
1799
17574
5869
142
13942
13038
8925
9139
5642
38744
23176
18366
199
4379
1637
2982
15594
5552
1153
8688
5825
8240
8903
1659
12619
1078
16262
3349
13327
6805
4792
4247
5656
10070
5681
7758
12967
10317
22530
885
20906
2276
10534
5068
1629
4601
23115
13685
8516
3935
14717
3260
11121
5315
5723
5141
8184
9075
3473
10892
2401
2255
2471
19219
17700
8685
19429
5702
7429
4393
3646
5566
7588
4754
13062
11802
515
8316
17458
3977
10957
18003
5796
9083
14360
10587
18794
23070
12110
11123
5535
14667
6611
21053
18156
34077
358
1773
5529
6254
2929
9579
2740
2916
8796
11843
29117
5079
1236
1132
4867
1316
10268
11624
11966
4802
9263
14077
#
6053
6926
6284
3894
18372
4254
15671
9413
452
3524
10209
11021
1783
4197
18734
35266
4404
11643
25835
17699
1425
15037
37466
5253
1344
501
377
20762
3309
4810
7678
12583
3023
2061
6424
13394
6863
11262
8500
1975
6827
18887
11733
___
3861
6488
1641
14387
22524
107
10661
218
6920
5467
12897
3458
27966
1371
8654
1767
3466
10249
11495
3006
5450
11878
18747
5584
1533
272
1998
1874
8914
6546
5677
11086
5299
4130
889
9982
8493
4512
10090
852
7156
6818
2305
26783
2842
3305
11906
7812
9148
4277
9949
6555
13373
875
62730
2623
6295
10058
4232
18852
34223
1072
2730
50684
13248
23137
6988
3056
104178
9645
11485
34477
7926
9363
6557
645
11768
124
2650
10122
672
2999
4098
1969
26408
2007
4180
12735
14256
11773
4133
4715
4300
8722
29031
851
6958
16827
4226
3165
8369
33402
3432
3376
3233
18986
5271
16921
5536
17910
14287
2575
12395
843
20450
5880
1744
1985
6812
12000
21631
11975
12629
24329
13979
2468
1948
13502
17800
2288
5988
3275
16565
2767
4686
6601
10178
12850
9275
13677
2354
11450
18226
13689
1296
9266
16773
9852
5357
6343
4562
9159
8901
3280
3214
2586
16291
5641
4457
13083
6934
13103
1674
5977
11346
5066
10738
14797
6101
6303
4153
4822
2451
6625
2116
4920
34066
15398
6905
8758
2633
2659
796
11575
13830
2649
3626
4505
2103
19056
921
1478
2447
5036
1848
20523
2413
5258
11116
4652
11817
17330
19048
3113
1859
5832
6794
23717
6142
1106
2970
1231
5600
9293
9499
2966
7271
20902
5682
2009
16108
17523
4990
4480
13276
4077
12515
481
12205
6300
8395
2986
8993
1781
4729
11535
946
23629
8483
5927
3754
6761
10345
9566
190
4426
11985
8213
27540
38050
16580
5062
9048
5491
46195
10684
1110
11481
5886
258
8907
313
5473
16551
5081
14056
26088
20349
2635
13548
9201
11259
9261
11324
10501
14564
5213
7614
3654
18368
25188
1054
8623
32327
8151
12872
8279
6341
8457
15180
9356
2322
8326
3289
9716
5020
6949
13054
4482
13661
44808
14566
5395
13553
11455
13238
11901
7703
10948
11373
1205
3591
1525
2427
478
1361
9449
13746
4646
6262
3059
12197
6868
11738
6974
6257
7164
4835
17830
3209
4282
14834
2017
3541
2096
20145
9857
9151
8648
4023
5778
9964
22829
8062
7043
5990
5393
9004
16235
5525
18360
5962
5176
25481
2535
13921
422
830
10270
12370
1599
9106
9813
7432
17414
3027
19559
10423
4613
12594
6185
2104
3862
3174
7066
4271
12699
2578
383
8877
9307
9655
14776
2747
4675
10565
33427
42370
8698
7982
11610
8948
13760
10028
14084
14240
2003
3521
10752
6544
13691
2197
7385
25694
14559
10434
14509
15575
3492
12873
3638
32952
7394
39007
41333
13733
23751
4468
9842
7521
6898
8031
12291
10885
8561
16693
13274
13890
9143
86
21720
7137
4752
16288
2964
6485
11633
9426
12185
35252
5629
14064
46426
13349
335
5110
8095
6171
7592
10979
5322
484
30245
13380
8625
4970
6760
4168
5221
1464
1259
8005
20772
3386
9127
12543
20113
6890
5810
^
11190
3599
5802
1091
1693
10274
14588
1561
19901
13422
15429
9164
3448
2306
5754
9033
3083
62935
5540
2997
36886
9858
12669
39843
3018
2007558
11414
11629
909
9277
28281
11993
5044
1029
2971
3124
5212
8230
3075
13632
32830
75972
16181
7957
5166
13962
11927
10295
6247
2020
10309
24237
5531
3258
3855
128337
3137
16586
17956
4064
11766
23482
5190
14523
3854
5359
11418
18075
6999
19830
9770
21460
7136
4169
5559
39392
8679
13027
3602
11758
3365
5302
404
884
8333
1456
3042
19639
9663
10121
11607
354
2149
24465
3736
29362
10575
310104
396
6515
5373
8083
7879
27740
11656
16436
11552
11645
3295
2874
596
32934
7474
16250
11515
1258
1534
5314
6265
25332
12586
28223
13030
25664
13358
10688
4419
16797
6007
7225
2117
24848
10493
2694
14659
25268
3341
4486
6807
3792
3169
1366
5402
1951
4899
2334
4977
4333
6104
4101
15847
3929
6563
5291
4058
32716
3311
2428
7501
39463
13903
4795
9451
3236
22300
2333
7799
9027
2691
1628
7885
12675
4072
32258
62680
51191
8697
6117
539
12127
4843
18035
11026
2919
5583
2906
3230
1409
595
3835
15794
2706
19033
18648
376
3870
11248
4900
2492
15049
3363
4208
12633
13431
6691
6062
3410
271
7810
12733
8149
6570
62750
11406
4249
14420
5920
15717
24986
5021
6509
3396
968
1615
5409
22029
5782
5572
5158
2910
6991
6411
19232
8655
26966
14974
7107
3737
13680
71159
21129
2459
11498
9899
7990
3918
15154
14710
7153
7707
3608
19920
3561
11057
4703
9188
13129
11136
2237
15892
38034
4434
1683
8300
16846
3156
1828
1665
7630
8159
11902
12734
4109
5508
16724
4210
10323
16620
1238
20711
34245
7907
4448
1034
11342
6188
8610
6995
5563
5092
6913
37188
4298
6599
14143
6167
8535
10394
5208
7103
20328
38892
2923
5332
3713
5573
15737
4427
6798
5616
13668
4587
10222
35581
9530
19367
24387
29372
779
14688
8912
7169
19836
18263
6946
21383
6280
6374
7777
2032
450
1935
6075
11948
15443
12707
53597
1494
9611
10772
5892
5775
4091
10110
14366
13354
48844
11106
27312
7154
2506
7036
11775
3914
8305
926
23084
3514
14061
3852
11313
5353
7053
12512
11427
37801
1987
4902
6480
8703
12460
1780
11332
9965
9459
4695
3662
1094
12442
9346
26771
18525
19027
5330
3262
15652
19660
6222
6537
1108
13479
3723
5485
11064
漏
931
8892
11395
14512
6391
10234
12030
2347
3834
5506
91
11679
7636
7119
1283
24923
14007
2723
27474
27307
2776
5811
593
15828
11956
7448
4849
13850
13720
12729
31393
4898
9976
22051
5460
3763
18926
10390
10557
3132
2606
9338
4076
3302
14753
13129355
7750
13153
2056
62988
8817
18666
24119
3573
3220
2040
19951
474
17292
2398
37704
1899
18429
3786
4081
8838
8208
23626
67
3143
3629
3804
3372
2486
3887
4735
6720
1747
26710
1427
2239
2947
743
4451
224
10306
8666
3954
4616
40995
5127
10990
11544
16709
4149
9684
2782
405
12650
10065
26344
2932
2609
18492
16475
7257
8968
13509
19010
5568
5686
9195
16786
4741
20967
14505
5982
10113
9086
13476
6325
8366
7217
62693
2232
8219
11865
14300
15494
7040
13483
34095
715
7062
3392
3747
9647
7004
19419
7692
19191
5960
3681
42863
23696
12082
2877
17706
9271
26507
19372
10000
5075
2015
20337
26069
21806
1130
4659
14803
6547
13024
11044
6996
23653
48768
31246
13251
1956
100428
4851
22402
8152
4361
7067
16344
12135
6729
14977
4497
8894
4411
2807
10419
1732
19061
4687
7123
24091
12885
14730
14939
5637
3658
2293
5052
11192
13047
4384
1501
4220
5726
11076
7291
1653
7122
5644
17059
15153
13357
9267
21730
165
1364
27308
7509
10184
14062
13287
4316
63570
24718
3074
9855
9396
11131
6289
8935
6513
10440
1506
11333
1219
28441
18261
17481
13634
6176
13836
2375
21310
3150
40093
20718
5429
28382
3769
12648
10515
6962
15439
8276
5865
8998
24044
6069
12980
2707
4332
11457
2115
32853
69880
5042
21346
11522
49398
8210
5151
3437
18660
13341
8824
4071
391
17257
8557
6744
7963
2514
19266
5441
1176
3824
21007
4561
7428
3489
26702
3346
13871
34642
2480
5040
18833
1441
4373
7034
5956
3308
18611
4045
3359
10756
8626
11863
34426
2557
6470
6201
15880
5148
721
7411
2283
8476
8959
6224
26656
17890
1681
42738
10876
1895
8537
8351
22439
14894
9228
8206
2049
36860
9134
19700
33755
90869
11571
18178
10133
9336
15773
25789
7032
3780
6507
5215
11528
1181
7381
25437
9236
4477
3814
1949
3161
2736
5492
4415
10139
26002
7800
14429
19630
1959
11117
7762
7927
18766
25449
8334
9137
23708
11207
3252
4820
17704
3222
23147
1685
9796
20618
28507
6960
24379
8996
173
11492
5177
35409
16244
6533
5905
2781
23306
5096
9428
20260
17299
9766
8314
18206
7496
2152
17565
9704
49983
22361
20004
4131
66786
14654
5804
1496
966
7269
17236
7421
11107
2374
26419
3357
35640
68388
16875
15305
62618
72089
2497
33083
1521
9071
6981
40376
3283
21112
25971
20047
11742
8554
13383
3007
7033
147
3254
10976
2523
20089
3483
9989
36140
3898
15284
1869
2847
16697
7268
6779
2426
14812
7039
5016
18632
7528
16886
87865
6103
3078
3094
29253
1553
19955
5028
2328
9860
13593
62739
7244
41871
18595
11777
6886
9315
7587
3387
2726
19735
4757
62782
1433
15729
18919
5844
6357
7532
4528
3815
5830
3656
24057
17818
11185
16629
2658
4945
6522
1383
13671
8424
10653
7299
6140
9288
20327
3964
5639
5254
8117
17408
7602
10802
19780
6626
9604
23189
50073
2160
24094
2835
4712
6797
33838
11104
20084
20604
19580
4204
26128
5645
12871
46254
15826
4531
5688
13877
2753
10645
12660
18442
19433
12879
7638
12037
15722
6904
8593
9155
10754
2963
4837
12978
34677
5252
11883
15743
3827
11940
17057
6362
7991
5876
6730
33326
9001
3413
11538
22265
11431
4046
7325
17384
24260
11744
3227
4297
15418
19040
13215
9919
14533
13080
3108
44879
17691
14825
22092
3866
2309
8391
4789
22994
1435
4323
18613
10576
20444
38002
30772
4959
24493
16657
10366
18481
9254
2858
10383
6821
21650
10160
9018
7041
11567
3598
1330
38471
8989
7442
17392
4213
5841
5929
11533
11872
7462
19736
3176
2676
69801
20002
21899
17986
24579
14794
11866
9742
787
16616
13257
5321
1206
20342
1609
6125
21102
4119
9108
63133
476
21149
20298
15960
3047
18487
27545
33298
735
20605
8125
3578
11756
11172
5431
13028
11536
34037
9057
16411
8486
15815
27204
12366
5901
27073
21071
4048
16216
17245
14002
3807
9205
3661
6338
9373
4602
19972
7830
8937
10443
44229
14800
6407
6239
6442
2272
4985
9488
19885
21116
10638
5482
9574
14747
1575
7908
1703
15864
9495
15642
457
8243
15278
17679
10127
5823
5318
11305
5561
9372
3404
1759
30065
10755
2183
6506
12091
156
19128
17055
15464
973
13048
3889
8439
5893
6772
14647
3393
5351
5874
8699
11778
31346
5597
13866
1654
6023
16263
17597
路
24330
4732
12476
22305
9881
9463
25490
1149
28232
9359
4499
856
17932
5515
18449
16651
16019
2594
106
8893
11566
10275
15471
9613
6330
28500
10805
126
9282
3655
2034
32823
8283
16460
26056
4720
17125
500
10426
11740
10864
9592
4224
30010
3702
3607
11377
7270
12986
10997
25194
30820
1736
3263
3965
12300
12805
3268
18218
7075
49288
19565
15456
26629
14178
4781
9154
8488
11100
8641
7632
38667
6121
2527
11267
11274
10776
5440
11396
25605
2119
2636
12272
11089
32289
20239
30107
27741
32379
22729
63501
19655
18173
8511
20007
36467
11899
9011
18458
29070
18405
3383
7173
6847
8977
2895
5606
11095
3060
5481
4320
15415
11229
32558
1362
5123
10984
13452
3038
50786
15050
9324
5232
54068
24144
27403
5339
13208
6670
19521
19298
1335
31368
9135
8502
30479
63504
7756
6073
4437
12422
634
11135
28408
42805
25055
5891
15190
9639
16732
19661
13860
57348
63540
23949
6094
29979
30386
3882
14342
12451
9807
490
4495
18086
11137
2203
22719
9508
4225
12042
14086
5189
1797
3126
5846
29114
365
24457
3767
9894
49772
29643
5994
21505
10965
18893
11507
4120
7286
2491
5710
28361
7816
16282
50060
33862
5912
12064
13803
13532
19247
4154
20386
8352
10130
46835
6264
10600
18411
3908
7925
5806
11155
10549
10818
4421
14157
1117
4125
5690
10952
24806
13008
11497
13201
25027
7318
6880
25818
6342
3294
3178
23134
1463
30719
21979
8268
17643
18104
15068
8102
4014
9069
11852
6973
3858
2287
18752
8464
3535
15094
43366
3183
38033
64758
9994
16346
14525
6972
3921
13022
19944
16030
11997
22921
2839
6423
14824
9811
810
8442
21114
16585
1504
8399
11474
14898
62529
.聽.聽.
2777
62833
24895
1738
20875
24250
35162
53399
17513
11988
18978
60976
17944
6901
9765
5934
11639
15820
5392
7409
6908
14390
16597
5589
11439
23250
20350
7525
14191
9452
11856
7778
1896
6091
11683
586
5461
14452
16005
19643
5700
62806
4989
4518
916
15292
3052
8157
217
8594
9759
4734
17690
18708
2819
15391
12062
2545
7601
10010
6293
6426
10252
7152
26126
37067
1519
3755
7953
12929
110921
14745
15427
69652
19589
13172
18258
62718
35235
14083
2402
15342
1995
22626
4341
23491
4054
\
13121315
9549
2249
4535
22085
2949
4785
16480
34661
2312
4894
16215
16501
24145
27478
12487
1305
7195
28289
62040
18562
19796
7159
1560
20807
8567
20872
22313
3369
7434
11438
5505
11746
8904
25071
4407
4418
15051
11253
20890
10464
2615
7583
230
18930
5745
10301
19511
886
6759
1633
3235
13444
17467
37317
5724
4157
7723
4925
4547
8584
29717
10518
14639
29488
3851
18695
7566
13271
18036
949
13116
11054
10911
13298
16380
9644
5181
14695
16278
4494
7850
11126
17820
21107
7550
2614
7287
6639
5172
10347
9202
4496
20001
991
25598
3863
44118
13813
8775
30890
22492
4123
4503
4976
4021
6501
13859
442
477
2775
21028
25388
10205
7140
34308
40788
3152
6311
18334
10467
11506
4122
1033
15470
25851
18467
4704
2709
53807
8355
5654
10298
4554
4474
28542
13065
4951
29291
17012
9512
982
4783
17182
13647
17451
29537
3990
4668
5294
8473
9207
17504
31129
9223
18964
6535
12400
10928
11704
7357
4243
16914
11890
6187
4775
8407
9947
9149
11079
6781
958
鈩
19332
26778
4177
9572
59882
24518
6604
6337
9957
**
11819
41228
8474
41656
18605
33999
4841
3409
3065
15698
3673
14047
3653
5795
11077
4918
7466
35134
12523
6446
10950
9276
18529
3306
20026
9335
20552
11068
33998
5746
2218
22535
3938
3079
13905
13043
24568
9763
25568
6413
40221
17587
26939
3422
2430
4693
1326
25923
19568
9063
4375
40388
28897
20976
23194
901
3832
2408
46412
14127
19410
14443
17453
19361
22465
15203
26593
5784
12896
8801
6975
9047
6145
21966
6589
20364
10951
23117
3129
23433
34985
12087
3464
18735
7549
2662
2208
4513
18371
8258
3367
31855
3418
19691
22823
10778
28196
7647
13688
2974
6671
11082
32926
9131
3438
62892
2167
25255
7180
9777
11022
23167
9712
4405
4669
4821
8363
12218
7082
22689
13235
3281
18569
19434
17455
9074
2710
21412
1813
18273
8513
12909
4623
17851
9635
12869
29360
12174
3555
18703
13190
39286
3822
18643
3572
9144
39169
13511
27420
4318
10926
14969
5625
5280
10900
3450
6212
21849
58955
4229
46281
23565
9869
42211
14462
3604
13266
22515
15845
13236
8555
20560
4950
6324
4862
3525
5119
24687
17099
10912
9897
4008
2470
9473
72577
23671
8226
14618
40602
5399
44710
28023
38010
41933
10036
19680
40660
16352
21299
31753
5551
5210
11603
9915
29541
47430
9471
12520
2217
14444
1914
17660
581
17382
10726
24096
18237
88275
8745
11772
11513
10704
23803
38016
18884
6476
4146
33138
32107
62645
11120
5517
24447
6209
7803
24876
5227
7547
7670
4118
4606
13014
6867
12584
23845
19715
2206
4617
13835
21293
28672
20931
46203
46553
28797
15780
3001
30046
2352
21840
9025
10223
2163
13638
1376
4371
5137
10431
13176
19163
598
17566
1954
1210
9120
15067
20797
1337
2809
4174
1940
2965
626
27098
10585
7316
4479
4946
9355
3417
8430
19481
62269
15018
11693
27620
1804
6603
4410
14441
19495
6602
11647
27541
11165
14906
15150
9917
3703
17443
18024
24318
15595
26819
13395
51509
16622
4099
11725
14603
21767
1089
1589
12233
24892
3960
72357
57125
7774
15399
22266
9882
13346
35462
***
8356
13750
17494
993
3810
6707
11230
17468
4390
14726
9126
20015
44326
4295
1229
21470
10083
22481
8762
9194
13856
44046
56401
52168
21056
9115
9319
14973
13295
3412
15468
11222
5671
8598
35141
34295
9942
11736
4317
12992
6474
9199
26276
10884
13723
6900
10621
31347
9142
14670
4840
17850
63273
30067
30000
19839
2511
6472
19241
7113
9526
5468
16888
29485
402
38177
10849
1095
6598
39842
``
3951
2031
10385
15720
16271
11423
463
25408
5873
4483
43490
34218
63240
19540
45083
7337
38556
19503
1723
9895
12705
26551
5091
13557
5073
15384
73
7313
14579
6572
11606
17688
16590
7000
5009
3279
11786
93357
17835
22559
7922
63023
10646
14704
11397
7823
18550
12157
23791
3932
7048
8911
11199
12237
34703
24691
53010
47850
28503
7403
10267
5511
6888
7600
19994
833
16417
36546
31020
13465
8154
12832
2823
9329
3842
4808
11602
16790
74828
1143
12244
16782
15446
2587
16799
8140
31229
31790
21781
12830
10998
9466
2181
23739
4672
29296
17188
12833
6530
12615
9661
41746
88
14419
9977
29122
16571
15715
25580
17145
22445
6025
4670
16428
26554
31547
10218
23768
35708
6786
60797
4926
13391
14373
17496
222
11398
30675
12153
25415
6613
37715
13642
39336
8215
10231
10643
17766
7920
14079
22049
46378
37939
5198
7840
11726
9447
3015
48853
20927
14611
8743
1058
9873
12922
33745
11170
6204
11813
48321
3331
21165
11808
30269
3520
18749
105400
4818
46257
8067
35279
20039
8096
18992
8035
10470
2048
5107
1870
8642
5478
7893
26871
418
12621
13073
19484
4022
13222
18444
30197
39020
12188
55160
2241
46541
26278
5054
17854
14554
4910
1980
9165
221040
14096
62365
16223
22358
30866
36568
3674
4383
5154
25375
26474
39692
14270
23606
2663
6713
5604
35913
18231
112640
5602
6857
3589
10945
8882
12889
7516
14569
20287
13925
18617
20245
17351
4626
14089
3093
2443
19710
19918
6801
3157
31457
13819
42512
18415
2860
20549
36783
63335
31555
8358
9510
3560
8468
18548
17844
14498
4593
12565
19465
105399
3499
17153
4748
13175
18297
59637
355
21700
12641
12208
43558
701970
266
15563
31786
20637
8591
5002
12116
1537
19156
5904
24256
19677
13462
952
14044
37102
12105
6778
4869
10073
7841
4540
3276
23836
9169
22347
19274
3286
48877
38990
19993
48566
4245
3545
10632
38349
75024
23259
15797
6644
18854
6371
22638
903
2878
13549
8384
1217
9650
13233
29631
4070
45133
8099
11638
62686
29902
17975
8415
40644
24585
4166
3243
19759
2879
7937
20369
37873
5659
8453
9652
7737
22352
2321
6427
1963
3766
2270
3888
15053
15742
6882
10449
23308
1212
20774
15082
7849
19822
4776
7827
40143
41217
98
3040
14878
32923
8896
22113
3508
4257
7993
2616
6899
11097
11046
3377
10728
24055
51532
4890
9290
18367
11944
15463
39548
11554
12588
3301
3615
18474
9539
8286
21708
19217
4852
18314
7397
43654
1837
3853
2695
22290
4338
324
17354
47045
53227
25364
20992
16283
13239
36443
36705
13913
5489
6647
39647
9891
10964
5595
15265
12377
11926
33078
7356
19864
19739
13137
1303
13896
20624
7386
6402
20104
7139
16088
39448
7115
21455
37963
20629
7247
18808
6844
11652
2326
5658
1845
19665
5196
30851
17887
13478
15971
27033
22156
5165
19546
38880
7887
4627
18457
11410
2445
42229
27260
10059
1768
1841
3322
25022
9401
13551
10437
9687
14956
11283
18007
33056
10409
17378
4182
18719
19492
14315
4112
17521
150309
32930
4293
948
9603
5
2673
14011
4759
14763
1701
15814
795
1976
4029
15189
6915
28743
13145
5084
265
24438
13735
13751
17511
6856
15113
9209
3293
19846
10297
3291
28474
7437
12066
10996
2590
28309
800
10283
14384
102178
12260
6767
52557
8118
25148
1922
26480
552
23094
12479
4743
2028
2863
519
14397
4002
13034
12200
14145
24337
11094
10674
19707
23765
7341
15719
17225
8916
10285
15256
33778
10525
40850
15210
25315
40205
6286
17974
9923
34748
4073
16033
8508
18470
3219
35651
9696
13496
6449
13013
4991
1194
13464
6716
63493
35434
9935
28566
26411
14967
31431
14008
2042
6160
24037
28089
9649
10235
7715
3630
24981
8868
8878
1250
14374
7430
11475
9657
24680
16398
27327
7759
52820
4637
103452
14775
39031
3788
21057
26611
26504
8278
13716
5008
16802
8659
6709
37572
23492
18692
1924
1554
5386
12203
22678
14685
25749
8861
3269
6664
9096
19392
16365
16259
13743
29655
8885
46589
2756
25074
9536
16575
12236
19936
9321
9285
14450
12829
33965
53320
18727
9721
11585
9189
9780
17717
25874
22756
35702
33555
8693
18753
23538
23635
5424
19928
23440
13888
9814
13070
5543
40519
4156
12262
24409
35049
10985
17399
23731
15756
4871
6255
14004
5885
20251
45714
3566
26674
13372
19076
30614
9181
2145
837
15658
16086
302
20221
40349
15311
1446
11205
21421
22855
17622
25111
10304
8081
7467
18268
31400
50432
13228
12599
42498
23896
33414
4525
14860
9232
43453
22652
6292
45201
16573
36066
18084
1679
9136
25280
10811
19403
22552
12882
13653
13244
4596
23163
16165
2540
7368
12919
9140
12112
20494
25393
31017
5085
6746
7282
16123
2913
14210
15079
11196
13583
31116
19057
7657
16106
12657
71571
11559
19479
2940
44209
2079
7865
18943
23602
11800
16097
34732
15081
4750
38394
4459
407
8400
10174
12415
3783
4184
28001
16931
13797
18578
27450
3172
10706
2732
32217
12511
19900
11461
9323
11453
5884
17764
33473
17846
17796
9565
49996
10961
129187
28794
13715
57283
6628
14173
18795
13592
12363
6970
19471
4895
29780
3906
15122
18028
19290
2631
37350
3981
18976
18729
6453
7227
3207
6475
7814
14410
63654
6464
2023
8632
6645
13253
37175
72443
18349
13011
17784
16917
14970
11033
5094
6186
15491
10924
3444
11983
21096
3374
10333
19402
5906
10026
17117
4510
8821
20885
9749
96815
1097
38009
6399
9038
16159
15767
10819
14493
47083
23242
26600
13315
17073
54203
35626
16399
5018
19146
23829
5143
18085
9888
19533
10049
34551
8708
8028
1213
19483
8223
17959
6721
36773
11447
19246
72648
5617
12417
11563
27154
22665
13261
200434
11729
17164
19650
@
41235
43380
88811
14177
43720
65248
9902
15295
15457
46602
4330
1245
12826
>>
18389
24803
9912
1570
7024
22048
2675
320
25176
5358
5744
7681
11594
32202
64754
47326
25205
25662
5488
3213
2001
4526
10227
13772
38003
36737
5668
10230
32528
2448
31749
147419
42605
6651
8212
11898
12928
7097
46294
4980
1884
8020
24886
8112
16101
16286
12603
6015
18707
4927
55369
30857
18568
36414
19082
28205
6591
79788
24534
13539
2436
27518
33303
44344
5833
4683
2190
14975
37045
219
10999
19262
21106
18885
25101
28405
6367
19907
10182
46780
17275
4923
19596
8242
14713
7168
23796
105278
34118
14351
25906
45751
11288
4261
42892
19814
23384
11805
33593
87
12683
11530
6228
16391
9900
2894
1159
4576
19956
18262
3354
14423
12352
4615
15221
9719
21100
4275
17520
5385
6617
12226
13667
25047
37633
83326
12093
27130
29449
30904
12204
7658
12644
12290
2915
16008
16031
29860
23423
13154
17470
17738
12572
5740
2371
2787
5216
36690
18750
13156
34488
41012
15560
20252
5579
38220
17076
34150
7346
17166
48946
6861
13404
18863
17667
8836
12207
53730
10520
8389
5317
16039
19339
17946
22882
7213
21843
30563
2785
19215
5451
2534
12788
30771
55351
12985
13595
7656
3913
5147
57719
11943
6368
1576
65307
39113
2410
29157
11067
47964
34035
11109
1824
9776
4454
11463
9669
10069
3961
7278
6562
23932
20546
5456
15064
30299
36861
41287
6927
25284
5683
19699
6605
25544
8423
9849
4376
7256
27238
30818
3005
32328
41747
59508
20457
5175
11539
18592
4356
36629
5363
4831
5526
7188
27839
22852
20673
7410
50054
4235
4827
50177
17729
9214
17980
10062
3077
4772
4353
82850
13121
63170
17097
6175
5951
16912
26060
10433
4196
67515
4160
63187
14510
11025
28473
25221
36359
16753
15751
20343
12407
5507
59246
19491
12123
6174
8339
31309
6210
805
31366
79672
24519
3800
40154
14538
38446
19150
8768
18431
24278
17852
4868
13099
18089
2931
36754
14128
3454
2191
6993
7208
13987
62384
14981
44579
1821
72206
1941
6590
12239
24801
760
3313
1274
6630
19852
56767
22897
29061
13204
20752
28719
23342
43840
5220
1640
15933
12604
23424
23203
28929
2789
10612
2300
13919
40181
3496
19963
24510
15145
3212
11065
18528
69435
18212
13323
1103
16439
16768
55
14593
3699
13588
38494
8870
26687
19717
19765
9610
10415
13806
5365
9256
64064
36060
46588
12452
39833
14167
17317
5438
29517
17843
19294
7558
808
17143
5753
7328
35037
3064
10678
15017
22895
1003
7070
13827
21997
25057
27466
6199
20534
14693
10546
14406
18890
11574
15790
24074
27525
1624
46550
16627
93773
18135
23890
31635
65489
26423
33155
28676
3618
15566
36332
18340
5364
19431
34190
7856
6631
8922
15954
9178
3505
6731
2233
9460
29242
2728
29821
6643
19252
1374
23493
10846
21034
15565
26776
11327
10566
28143
35296
29007
9273
34483
4697
18608
9933
13149
11471
5910
14261
15461
9583
13666
23941
8520
2314
34217
8032
3107
23517
7712
11815
15318
16329
1682
32775
6825
13706
10663
3564
5061
6879
9328
68240
2224
32272
4826
11072
2464
9790
3344
18853
1743
6109
20357
64828
6152
17032
32724
36347
11419
4800
14721
14311
6966
29135
8263
12182
6828
1517
21025
26589
18909
49182
693
7868
19072
63639
46566
7848
18765
17305
659
20969
22149
10955
14268
19322
3748
3246
5863
9997
4607
12813
14087
3768
23716
8960
25258
79382
25316
18108
26211
28170
45250
2519
7294
9241
13085
40629
4731
26563
9109
13721
12528
9265
31035
19523
20268
29509
34385
10031
14310
989
22726
11150
52244
3353
35879
15741
77030
7130
18806
1672
19835
8027
6136
35424
1185
15554
10973
33024
7003
8778
12662
88089
12310
30178
26744
34465
24868
17431
13928
11534
14821
22467
20892
16466
12006
32442
26526
31503
4252
36390
53464
6203
9122
8058
2363
33832
35345
5790
29371
21264
13336
19264
22767
11195
7203
12014
24977
57371
13793
31521
17259
708
21362
9441
820
9929
17616
96790
1324
367184
18466
20654
12221
7535
23253
43333
10708
2433
19300
28849
3223
10056
1007
37616
46403
15784
7412
12072
14587
3869
24081
23014
8780
16645
682
6490
22819
5537
19390
17492
9985
16506
1965
15235
16834
6183
39182
5813
51011
17904
10111
20189
9771
62549
3162
5474
13052
29980
1252
20683
35901
2784
46213
36804
5978
11994
23483
14725
6419
8945
1163
32305
35223
7281
111382
2714
11385
39155
44490
8485
26693
40854
167
16650
17743
54866
12727
24317
20684
12268
8663
12951
8440
9170
14242
19451
23116
9674
13843
15659
42848
13895
20518
5957
13650
14897
4400
14573
47787
713
23157
2869
29750
13705
21415
30485
2798
26099
4381
15735
2076
17711
898
12580
27194
5808
30543
3440
24201
20540
23546
8613
11027
14913
14193
8180
5992
64777
4717
62685
24704
9334
10485
16412
3134
43022
23712
14660
18706
13010
56319
86486
5458
10373
18049
15240
5969
23858
29944
14068
15288
27330
3092
18044
45172
11214
13286
13711
54061
3303
21692
13645
33408
19287
5218
2477
5768
33566
23853
14142
23185
126291
36623
16832
928
34279
7936
16870
37167
禄
11986
6747
13839
31490
24840
25313
19870
13207
5634
7019
4657
785
10398
5422
10769
6143
22371
3069
7298
33355
17942
29131
31832
15129
40567
11637
6909
33187
37810
7644
5231
13347
35941
10282
21239
30109
19957
14070
8579
26796
51238
43046
5078
50064
11228
20708
37789
24019
7642
44726
16026
9157
14190
7175
44187
18400
65
11703
15179
37626
19104
27436
48165
9370
37473
10271
20416
21115
10883
21625
33937
70934
13384
13573
18251
12686
17925
2024
10197
3171
9477
9503
6683
15501
5701
15394
8950
7275
15275
41615
24767
20339
7167
18732
17495
17560
5932
6211
2346
26141
3583
2779
10665
15259
17291
13366
1311
13687
18160
71805
6438
18404
10798
3148
17791
13055
2138
11443
17068
9636
7540
13561
17714
15628
6748
16326
40109
22910
37027
22132
6937
17724
415
7279
29346
6241
25555
10194
26401
36460
46610
27049
2713
3247
3405
55305
19368
42493
6669
39688
8044
1775
18731
19084
38532
38763
13211
11236
11088
68762
16812
17413
6710
57921
29735
5946
21512
4481
11660
16490
11040
21803
27994
1802
2848
51927
16285
61790
27476
43178
14403
4246
16840
40407
16544
3789
3037
6877
3185
82656
3616
4273
14266
56845
37168
17016
14051
17373
18074
19168
15549
995
5911
8411
9737
4860
11512
7261
33978
20442
8126
1079
24642
70809
14995
21011
54452
17038
6350
198633
12225
19502
106872
33568
51887
19603
28494
7327
3071
8318
26122
17869
10960
14833
11717
19221
2065
3160
鈻
27530
15833
18929
32173
15237
14200
24991
16977
28753
7826
9837
17575
11276
30230
11543
45181
728
19651
57590
11459
19599
14524
30847
21987
14416
9045
8628
27528
6538
1974
22284
63566
1140
14264
6942
36677
5179
13493
12601
21962
54035
21459
27133
9190
10857
11750
7147
841
8238
40098
9366
3577
4550
29524
4915
26119
4726
54164
4124
16095
45576
26245
29260
23877
26238
20396
27404
71202
9971
18851
8194
35642
38306
29532
36481
7377
28818
16511
2687
21977
20214
7389
17220
31616
10583
48314
24483
56722
8653
1144192
10022
11032
8695
53230
40879
10775
9312
15239
43021
9682
23534
34011
11573
30826
9724
5384
17046
17224
11460
14316
9793
6810
23543
20773
29559
1597
4127
7730
53688
9986
49338
19728
16863
13399
128506
11929
2980
1785
10859
9874
1138
7194
27406
34085
19381
30478
4676
76112
11449
18238
17790
35318
14594
25621
28456
13811
5155
76204
10568
18991
26382
18361
3758
10845
23161
10584
47339
12339
77789
3988
22991
6344
6432
5510
19862
25812
5725
2077
3595
13234
13809
7929
16960
3944
23953
7747
3481
52031
4941
1410
18721
12018
10422
10162
4049
28432
15904
36698
6132
7230
13067098
2595
5630
22781
29952
6526
5518
26029
70975
26018
11415
26398
5180
11600
25836
11401
8169
38325
14396
18243
27135
14169
16690
762
10052
49102
42929
32381
2361
8136
13768
26580
18864
17708
38074
6823
15371
19352
42492
11523
2058
34573
6320
10482
54071
12376
4102
25942
10580
12923
2083
253
54573
242
32387
8884
36528
2088
34974
9862
4568
6478
3329
37415
69615
30364
56642
24054
7504
112802
27019
10874
26823
32468
42807
11877
13135
14296
24659
26902
18821
16094
19378
52144
11043
16804
8348
7206
21835
9691
43683
50318
1520
35869
3112
35081
19360
23963
4276
22207
50422
20083
20186
11721
6607
8587
11968
11576
28074
26257
15462
17719
25824
2539
37665
34822
4622
29654
9958
31642
38676
9227
16374
4939
19530
12048
35897
12416
24005
14601
21761
79666
17469
32811
10351
40723
7259
17482
17406
12730
2316
12847
16740
5831
62780
9722
38283
932
5997
42
14773
19840
44573
16658
6314
8866
21122
8929
40698
24156
18001
17964
37325
51697
15057
5396
30047
5706
24235
6516
1035
5226
31507
40755
33991
44276
10248
576352
13771
14590
35939
8779
8849
35253
19506
12012
44636
6953
20570
10831
12264
44138
144832
5343
22845
23177
17321
23952
14496
2424
13369
15139
25850
15975
26007
50749
8881
7700
53958
10538
18542
5276
28793
11836
16209
48895
62229
18946
17740
17203
3456
1045
6429
18019
19788
61577
14417
14339
3647
20812
46007
29241
10516
18779
24872
11375
18416
11341
42425
12029
20212
6178
14806
8405
745
17591
14154
49167
7942
5051
33342
12118
13430
39829
3234
54882
15837
21846
19254
25553
72444
14156
6467
21624
10878
53392
10079
21094
10601
16540
13556
113264
17106
8401
25367
49410
1649
7400
4137
14356
12502
41375
4666
7844
15476
361
22294
6922
8837
6594
27240
5064
4358
12301
21016
3076
11592
5229
33861
4294
1032
10561
11416
10848
14508
39284
861
8254
1636
16919
26503
21086
18052
14617
28157
16726
12530
15043
35187
3733
37540
19457
10379
44653
23258
5391
13021
119571
11329
43263
12643
20815
6395
23734
15191
2533
1543
6608
21064
18149
30031
5902
25559
22494
17104
44027
8123
37225
7679
11581
1994
23660
6758
14365
8897
2556
3523
6986
1623
11799
51259
12758
14326
3513
56111
43312
20078
12430
17226
21424
29030
11960
382
7179
35166
64866
48061
75276
7182
3228
41347
12293
9243
3710
92521
24301
15569
8955
52712
30149
29055
3873
16793
65274
26072
11240
14019
6253
16379
23785
10875
12861
48610
35260
88377
9602
984
27241
26115
11837
14042
14260
11096
14905
6417
42537
16485
13598
1419
24821
21374
3841
3099
48482
29154
38083
10573
1083
20899
4150
12870
23631
33979
17742
22632
23786
13585
14037
41115
15225
8161
6961
7605
5666
34038
14179
15084
373
19259
29174
25263
35137
13669
23863
26970
25690
95946
3718
11091
36569
12661
33990
44164
6165
6565
27242
13401
38042
14188
33703
4698
13268
85552
23989
6250
11801
43203
25576
40834
25230
34273
1999
16574
10739
2441
4469
144101
16932
16121
13885
31250
31679
33194
1368
19256
40292
2378
27560
23905
35686
4897
1579
23136
24141
27236
23254
24129
26577
7668
22291
5719
24449
23090
63644
630
12211
36088
24751
13472
3338
25395
39303
29943
14094
14691
1769
3924
53984
10406
20887
5847
52671
12379
37486
15777
24311
19200
8362
24323
31615
7326
19754
65760
19202
22151
24822
23431
1166
14172
14558
5193
10607
7398
6897043
370
10737
31909
2884
16682
33437
10389
25633
10499
8249
4660
20155
34730
20662
23064
26234
27787
107550
2158
27244
783
25291
4814
10257
11739
13282
34162
19430
4887
2995
26623
12074
1650
3584
50098
50606
1209
20517
7767
83341
13410
53036
4968
!!
1332
19462
24916
38713
13620
18580
11393
29289
10427
19978
8220
13570
22379
13290
8658
4832
9557
8225
29922
45994
8050
13223
9605
15039
531
11661
88692
9637
5939
18352
6213
325
17319
9305
9102
29718
21935
18869
15798
18482
21507
45418
14196
2934
16811
39057
12858
24587
4673
49077
10904
12084
24651
63107
47142
5041
21515
7749
28174
5877
17385
6016
10104
19873
41295
20700
6321
18656
19178
6223
15102
171
24921
33973
25007
20937
13683
22066
12397
10224
17663
14024
52740
16521
13007
13230
19308
18419
27438
27954
31598
18022
9599
26493
20311
1892
3068
6319
3355
44513
14050
18090
19672
14727
14088
13729
28825
99718
14724
36696
7906
9743
6376
3138
8560
12336
31157
21796
6580
7801
6089
17380
7944
26373
12405
25311
14904
5756
5670
19935
9774
43892
63028
15875
35390
24410
23752
55662
33779
5676
88483
47308
12835
2338
43114
8269
38908
10696
14370
15571
8340
40655
10533
22486
21887
9474
7665
14209
13795
27573
13953
17249
5390
9340
52050
20329
20365
19613
58843
27128
21702
3752
22499
23075
17812
38932
48888
39319
13773
756
12560
15601
31970
13956
21183
12851
24630
8811
63955
35297
26520
65007
31248
22523
8512
48509
16202
39786
1580
11970
63650
1144
7150
6799
12145
7523
11580
15025
19461
1754
4334
5714
13891
5500
16284
54621
11613
24325
15289
11159
12912
91814
12765
20471
8946
4313
2821
12275
9352
5623
25466
20672
18172
4839
6390
6147
76987
21078
11000
11018
11412
17508
15855
19353
3631
17528
17411
11149
13673
30344
8883
5621
11448
64275
21697
725
20435
30356
53773
13414
9411
40307
6127
9464
4706
14514
55353
17540
14991
28508
22853
591
24591
39050
9509
28057
16184
14866
27136
24844
37104
45313
22816
13899
16356
32991
2996
48823
31956
63200
18408
42460
23903
31353
20630
27149
10697
69054
12133
3435
7143
2852
66939
36477
15589
5856
40036
12676
29645
12178
27060
4906
16069
4662
9192
21865
30343
38148
11254
68412
7493
1002
12716
15450
}
6575
22301
10412
21257
4987
10634
29219
5111
6508
28495
2783
10424
6457
12848
16323
22046
10055
10076
467
14228
26963
24685
23143
12772
4095
31932
62777
27310
10374
19608
20521
69324
14578
6397
2254
28384
10219
1745
69972
46902
6327
36588
23869
143628
3054
10536
2529
6279
37171
4063
12286
15351
32866
162080
4256
53088
10581
18291
18882
15440
45728
9250
62878
14577
1391648
22108
74679
15063
20588
24373
10626
39752
8259
97136
1603
41751
15249
6048
37301
54269
11659
11916
22268
9618
4490
122999
48593
24451
49168
16310
39887
40889
33067
22881
17834
9714
24639
40084
12913
9055
17518
12354
10314
83583
23021
40359
9561
63607
13078
10530
29343
6636
25443
765
1407
30033
24528
9846
25231
4886
17241
32495
15272
13090
15248
19741
25692
20691
44263
18347
19964
12840
53060
11058
11167
121977
31218
17457
48837
74436
22160
4940
25499
8106
36372
143345
5125
20920
4340
40280
3928
4710
6938
5936
42840
3502
14345
19790
8958
2503
28695
6965
23171
23274
5336
24229
22168
20445
22257
36749
17020
21718
38631
18225
18670
568
17579
3946
24184
37001
110901
3091
21828
47151
18923
13345
27044
37159
22922
1046
134323
14233
33952
19355
17951
26931
40414
55525
6560
109814
54507
30325
26433
38501
92320
16195
7822
15055
17727
26311
25569
9692
19031
24756
25153
25859
15416
16364
11099
37612
13558
24681
24191
56862
47373
23076
8934
50320
11005
10605
18236
12080
2201
1983
16134
23780
28012
17721
1856
7030
10040
93673
24038
39141
35968
23876
12265
28866
11365
11366
15294
22004
18303
50282
5599
6463
79957
5168
14130
3515
8832
4069
10004
2844
5219
12411
6989
21452
9593
10017
9705
12010
12883
29422
25323
24782
38205
22716
29774
4343
10866
30605
22711
29602
11996
146
16582
20881
3506
8030
11754
14284
30172
12578
9058
8619
10085
15769
23346
36374
34163
55852
12924
20557
19073
29391
10061
20122
8201
6935
7093
39270
43643
3384
17809
54816
36836
18653
5025
6418
5076
11215
5743
11363
8702
57652
16396
14244
4189
7955
18587
90070
7769
23501
34086
4566
16149
14090
25267
37909
29966
7732
13297
69399
46672
26579
38307
14952
22256
2855
5162
9061
9872
19990
28882
21357
1909
23604
20377
69313
41639
87363
103718
25482
38649
33373
7251
57848
22096
